/* Localized versions of Info.plist keys */

NSHumanReadableCopyright = "Copyright 2007 Druware Software Designs.";

AMName = "Run Dynamic PostgreSQL Command";

/*  AMApplication localized strings  */
/*  e.g. "TextEdit" = "TextEdit";  */

/*  AMCategory localized strings  */
/*  e.g. "Text" = "Text";  */

/*  AMDefaultParameters localized values  */
/*  e.g. myDefaultIntegerParameter = 0;  */
/*  e.g. myDefaultStringParameter = "Default String Value";  */

/*  AMDescription localized strings  */
AMDAlert = "";
AMDInput = "none";
AMDNote = "";
AMDOptions = "Populate the User Name and Password, the query to run will be provided fro mthe prior action.  The query will not work without a valid login and password.";
AMDResult = "Returns an array of records, if appropriate.";
AMDRequires = "Requires the PGSQLKit.framework to be present in either /Library/Frameworks or ~/Library/Frameworks";
AMDSummary = "Executes a query against an PostgreSQL database, and returns a list of data elements from the database.";

/*  AMKeyword localized strings  */
/*  e.g. "Filter" = "Filter";  */

/*  AMWarning localized strings  */
ApplyButton = "(* Button label for user to add proposed Action, e.g. Add. *)";
IgnoreButton = "(* Button label for user not to add proposed Action, e.g. Don't Add. *)";
Message = "(* Warning message presented to user goes here. *)";